In [1]:
!conda list | grep pandas

'grep'은(는) 내부 또는 외부 명령, 실행할 수 있는 프로그램, 또는
배치 파일이 아닙니다.

In [4]:
import pandas as pd
df = pd.read_csv('friend_list.csv')
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [5]:
df.head() # 처음부터 5개 head(n) 가능

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

In [6]:
df.tail(3) # 끝에서 n개

    name  age      job
3  Julia   40  dentist
4  Brian   45  manager
5  Chris   25   intern

In [8]:
df = pd.read_csv('friend_list.txt')
df # txt파일도 정확히 불러올 수 있음

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [9]:
df = pd.read_csv('friend_list_tab.txt') # tab으로 구분된 컬럼 불러오기
df

         name\tage\tjob
0     John\t20\tstudent
1  Jenny\t30\tdeveloper
2     Nate\t30\tteacher
3    Julia\t40\tdentist
4    Brian\t45\tmanager
5     Chris\t25\tintern

In [13]:
df = pd.read_csv('friend_list_tab.txt', delimiter = '\t') # 파라미터 추가, delimiter = '\t'라고 알려줘야함
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [14]:
df = pd.read_csv('friend_list_no_head.csv') # 헤더가 없는 파일
df

    John  20    student
0  Jenny  30  developer
1   Nate  30    teacher
2  Julia  40    dentist
3  Brian  45    manager
4  Chris  25     intern

In [15]:
df = pd.read_csv('friend_list_no_head.csv', header=None) #헤더가 없다고 알려줌
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher
3  Julia  40    dentist
4  Brian  45    manager
5  Chris  25     intern

In [16]:
df.columns = ['name','age','job'] # 칼럼 정보 알려주기
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [21]:
df = pd.read_csv('friend_list_no_head.csv', header=None, names= ['name','age','job']) # 한줄로 표현 names = List of column names to use.
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [22]:
import pandas as pd
friend_dict_list = [
    {'name':'John', 'age':25, 'job':'student'},
    {'name':'Nate', 'age':30, 'job':'teacher'}
]
df = pd.DataFrame(friend_dict_list)
df

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [24]:
df = df[['age','name','job']] # 컬럼 순서 바꾸기
df

   age  name      job
0   25  John  student
1   30  Nate  teacher

In [30]:
from collections import OrderedDict # 키의 순서를 보장하는 Ordered Dictinoary
ordered_dict = OrderedDict(
    [
        ('name',['John','Nate']),
        ('age',[25,30]),
        ('job',['student','teacher'])
    ]
)
df = pd.DataFrame.from_dict(ordered_dict) 
df

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [33]:
friend_list =[
    ['John', 20, 'student'],
    ['Nate', 30, 'teacher']
] #key 값 만들기
column_name = ['name','age','job'] # 칼럼 헤더 만들기
# from_records에 파라미터(키, 헤더) 추가
df = pd.DataFrame.from_records(friend_list, columns = column_name )
df

   name  age      job
0  John   20  student
1  Nate   30  teacher

In [36]:
# 한 번에 추가
friend_list = [
    ['name',['John','Nate']],
    ['age',[20,30]],
    ['job',['student','teacher']]
]
# df = pd.DataFrame.from_items(friend_list)
'''from_items는 사용되지 않으며 향후 버전에서 제거됩니다. 
대신 DataFrame.from_dict (dict (items))를 사용하십시오. 
'''

df = pd.DataFrame.from_dict(dict(friend_list))
df

   name  age      job
0  John   20  student
1  Nate   30  teacher

In [40]:
import pandas as pd

friends = [{'name': 'Jone', 'age': 20, 'job': 'student'},
         {'name': 'Jenny', 'age': 30, 'job': None},
         {'name': 'Nate', 'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friends)
df = df[['name','age','job']]
df

    name  age      job
0   Jone   20  student
1  Jenny   30     None
2   Nate   30  teacher

In [41]:
df.to_csv('friends.csv') # 데이터프레임 csv 파일로 저장
# df.to_csv('friends.csv', index = True, header = True) default
'''
index = False / row id제거
header = False / 컬럼명 제거
'''

In [44]:
df.to_csv('friends.csv', index = False, header = True, na_rep ='-')
'''
na_rep = 'none 대체값'
'''

"\nna_rep = 'none 대체값'\n"

In [45]:
import pandas as pd

friend_list = [ 
                ['name',['John', 'Jenny', 'nate']],
                ['age',[20,30,30]],
                ['job',['student', 'developer', 'teacher']] 
              ]
df = pd.DataFrame.from_dict(dict(friend_list))
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   nate   30    teacher

In [47]:
df = df[1:3] # 지정 인덱스, 마지막 인덱스는 포함하지 않음, 변수에 담아줘야 함
df

    name  age        job
1  Jenny   30  developer
2   nate   30    teacher

In [53]:
friend_list = [ 
                ['name',['John', 'Jenny', 'nate']],
                ['age',[20,30,30]],
                ['job',['student', 'developer', 'teacher']] 
              ]
df = pd.DataFrame.from_dict(dict(friend_list))
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   nate   30    teacher

In [49]:
df.loc[[0,2]] # loc함수로 로우,칼럼 선택&필터

   name  age      job
0  John   20  student
2  nate   30  teacher

### by column condition

In [50]:
df[df.age>25] # 질의형 선택

    name  age        job
1  Jenny   30  developer
2   nate   30    teacher

In [51]:
df.query('age>25')

    name  age        job
1  Jenny   30  developer
2   nate   30    teacher

In [55]:
df[ (df.age>25) & (df.name == 'nate')] # 복수 질의

   name  age      job
2  nate   30  teacher

## Filter Column

In [56]:
'''
by index
'''
friend_list = [ 
    ['John', 20, 'student'],
    ['Jenny', 30, 'developer'],
    ['Nate', 30, 'teacher'] 
]

df = pd.DataFrame.from_records(friend_list)
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher

In [57]:
df.iloc[:,0:2]
'''
iloc[row시작:row끝, col시작:col끝]
'''

       0   1
0   John  20
1  Jenny  30
2   Nate  30

In [58]:
df.iloc[0:2, 0:2]

       0   1
0   John  20
1  Jenny  30

In [59]:
'''
by Columns Name
'''

df = pd.read_csv('friend_list_no_head.csv', header = None, names = ['name','age','job'])
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [61]:
df_filtered = df[['name','age']]
df_filtered # job 칼럼 필터하기

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [63]:
df.filter(items = ['age','job']) # 원하는 칼럼 필터

   age        job
0   20    student
1   30  developer
2   30    teacher
3   40    dentist
4   45    manager
5   25     intern

In [64]:
df.filter(like='a',axis=1) # a가 들러가는 칼럼(axis=1) 질의형 필터

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [65]:
df.filter(regex='b$', axis=1) # 정규표현식 regex

         job
0    student
1  developer
2    teacher
3    dentist
4    manager
5     intern

In [66]:
import pandas as pd
friends = [{'age': 15, 'job': 'student'},
         {'age': 25, 'job': 'developer'},
         {'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friends,
                  index = ['John','Jenny','Nate'],
                  columns= ['age','job'])
df

       age        job
John    15    student
Jenny   25  developer
Nate    30    teacher

In [67]:
df.drop(['John','Nate']) # row 삭제

       age        job
Jenny   25  developer

In [68]:
df.drop(['John','Nate'], inplace = True) # drop내용 적용

In [69]:
df

       age        job
Jenny   25  developer

In [73]:
friends = [{'name': 'John', 'job': 'student'},
         {'name': 'Ben', 'job': 'developer'},
         {'name': 'Jenny', 'job': 'teacher'}]
df = pd.DataFrame(friends,
                  columns= ['age','job'])
df

   age        job
0  NaN    student
1  NaN  developer
2  NaN    teacher

In [80]:
friends = [{'name': 'Jone', 'age': 20, 'job': 'student'},
         {'name': 'Jenny', 'age': 30, 'job': 'developer'},
         {'name': 'Nate', 'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friends,
                 columns = ['name','age','job'])
df

    name  age        job
0   Jone   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [81]:
df.index[[0,2]]

Int64Index([0, 2], dtype='int64')

In [82]:
df = df.drop(df.index[[0,2]]) # 인덱스 번호로 로우 삭제
df

    name  age        job
1  Jenny   30  developer

In [83]:
df = pd.DataFrame(friends,
                 columns = ['name','age','job'])
df

    name  age        job
0   Jone   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [85]:
df = df[df.age > 20] #질의2
df

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [90]:
df = pd.DataFrame(friends,
                 columns= ['name','age','job'])
df

    name  age        job
0   Jone   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [88]:
df = df.drop('age',axis=1) # 칼럼 삭제
df

    name        job
0   Jone    student
1  Jenny  developer
2   Nate    teacher

In [91]:
df.drop('age',axis=1, inplace= True) # drop 내용 적용
df

    name        job
0   Jone    student
1  Jenny  developer
2   Nate    teacher

In [92]:
import pandas as pd
friend_dict_list = [{'name': 'Jone', 'age': 20, 'job': 'student'},
         {'name': 'Jenny', 'age': 30, 'job': 'developer'},
         {'name': 'Nate', 'age': 30, 'job': 'teacher'}]

df = pd.DataFrame(friend_dict_list, columns= ['name', 'age', 'job'])
df

    name  age        job
0   Jone   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [93]:
df['salary'] = 0 # 칼럼 추가
df

    name  age        job  salary
0   Jone   20    student       0
1  Jenny   30  developer       0
2   Nate   30    teacher       0

In [94]:
import numpy as np
df['salary'] = np.where(df['job'] != 'student','yes','no') 
'''
numpy로 df['salary']수정 True = 'yes' False = 'no'
'''
df

    name  age        job salary
0   Jone   20    student     no
1  Jenny   30  developer    yes
2   Nate   30    teacher    yes

In [95]:
friend_dict_list = [{'name': 'Jone','midterm':95, 'final':95},
         {'name': 'Jenny', 'midterm': 85, 'final': 80},
         {'name': 'Nate', 'midterm': 30, 'final': 10}]

df = pd.DataFrame(friend_dict_list, columns= ['name', 'midterm', 'final'])
df

    name  midterm  final
0   Jone       95     95
1  Jenny       85     80
2   Nate       30     10

In [96]:
df['total'] = df['midterm'] + df['final'] # key값 연산한 칼럼 추가
df

    name  midterm  final  total
0   Jone       95     95    190
1  Jenny       85     80    165
2   Nate       30     10     40

In [103]:
df['average'] = df['total'] / len(df[1:3]) 
df

    name  midterm  final  total  average grades
0   Jone       95     95    190     95.0      A
1  Jenny       85     80    165     82.5      A
2   Nate       30     10     40     20.0      F

In [109]:
'list + for 문 활용해서 df에 성적칼럼 추가'
grades = []
for row in df['average']:
    if row >= 90:
        grades.append('A')
    elif row >= 80:
        grades.append('B')
    else:
        grades.append('F')
print(grades)

df['grade'] = grades
df

['A', 'B', 'F']

    name  midterm  final  total  average grades grade
0   Jone       95     95    190     95.0      A     A
1  Jenny       85     80    165     82.5      B     B
2   Nate       30     10     40     20.0      F     F

In [111]:
'''
apply()함수 적용 + 칼럼 추가
'''
def pass_or_fail(row):
    if row != 'F':
        return "Pass"
    else:
        return "Fail"

df.grade = df.grade.apply(pass_or_fail)
df

    name  midterm  final  total  average grades grade
0   Jone       95     95    190     95.0      A  Pass
1  Jenny       85     80    165     82.5      B  Pass
2   Nate       30     10     40     20.0      F  Fail

In [113]:
'''
apply2
'''
date_list = [{'yyyy-mm-dd': '2000-06-27'},
             {'yyyy-mm-dd': '2007-10-27'}]
df = pd.DataFrame(date_list, columns = ['yyyy-mm-dd'])
df

   yyyy-mm-dd
0  2000-06-27
1  2007-10-27

In [114]:
def extract_year(row):
    return row.split('-')[0] # 0번째 인자 획득

df['year'] = df['yyyy-mm-dd'].apply(extract_year) # 년도만 획득한 키가 들어있는 칼럼추가
df

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2007-10-27  2007

In [115]:
friend_dict_list = [{'name': 'Jone','midterm':95, 'final':95},
         {'name': 'Jenny', 'midterm': 85, 'final': 80},
         {'name': 'Nate', 'midterm': 30, 'final': 10}]

df = pd.DataFrame(friend_dict_list, columns= ['name', 'midterm', 'final'])
df

    name  midterm  final
0   Jone       95     95
1  Jenny       85     80
2   Nate       30     10

In [116]:
df2 = pd.DataFrame([
    ['Ben',50,80]
], columns= ['name','midterm','final'])
df2

  name  midterm  final
0  Ben       50     80

In [118]:
df.append(df2, ignore_index=True) # ignore_index index 무시

    name  midterm  final
0   Jone       95     95
1  Jenny       85     80
2   Nate       30     10
3    Ben       50     80

In [142]:
import pandas as pd

student_list = [{'name': 'John', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Nate', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Abraham', 'major': "Physics", 'sex': "male"},
                {'name': 'Brian', 'major': "Psychology", 'sex': "male"},
                {'name': 'Janny', 'major': "Economics", 'sex': "female"},
                {'name': 'Yuna', 'major': "Economics", 'sex': "female"},
                {'name': 'Jeniffer', 'major': "Computer Science", 'sex': "female"},
                {'name': 'Edward', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Zara', 'major': "Psychology", 'sex': "female"},
                {'name': 'Wendy', 'major': "Economics", 'sex': "female"},
                {'name': 'Sera', 'major': "Psychology", 'sex': "female"}
         ]
df = pd.DataFrame(student_list, columns = ['name', 'major', 'sex'])
df

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

In [135]:
groupby_major = df.groupby('major') # 'major' 항목으로 묶기
groupby_major.groups # groups.fh ghkrdls

{'Computer Science': [0, 1, 6, 7], 'Economics': [4, 5, 9], 'Physics': [2], 'Psychology': [3, 8, 10]}

In [129]:
print(groupby_major)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000002185ADE1340>

In [137]:
'''
첫번째 인자 = groupby_major key값
두번째 인자 = groupby_major key값의 항목별 데이터 개수
'''
for name, group in groupby_major: # groupby_major변수에서 name, group 호출
    print(name + " : " +str(len(group))) # can only concatenate str (not "int") to str
    print(group)
    print()

Computer Science : 4
       name             major     sex
0      John  Computer Science    male
1      Nate  Computer Science    male
6  Jeniffer  Computer Science  female
7    Edward  Computer Science    male

Economics : 3
    name      major     sex
4  Janny  Economics  female
5   Yuna  Economics  female
9  Wendy  Economics  female

Physics : 1
      name    major   sex
2  Abraham  Physics  male

Psychology : 3
     name       major     sex
3   Brian  Psychology    male
8    Zara  Psychology  female
10   Sera  Psychology  female

In [143]:
'''
한 줄로 정리하기
'''
df_major_cnt = pd.DataFrame( {'count' : groupby_major.size()} ).reset_index()
df_major_cnt

              major  count
0  Computer Science      4
1         Economics      3
2           Physics      1
3        Psychology      3

In [148]:
groupby_sex = df.groupby('sex')
for gender, group in groupby_sex:
    print(gender + ' : ' + str(len(group)))
    print(group)
    print()

female : 6
        name             major     sex
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

male : 5
      name             major   sex
0     John  Computer Science  male
1     Nate  Computer Science  male
2  Abraham           Physics  male
3    Brian        Psychology  male
7   Edward  Computer Science  male

In [149]:
import pandas as pd
student_list = [{'name': 'John', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Nate', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Abraham', 'major': "Physics", 'sex': "male"},
                {'name': 'Brian', 'major': "Psychology", 'sex': "male"},
                {'name': 'Janny', 'major': "Economics", 'sex': "female"},
                {'name': 'Yuna', 'major': "Economics", 'sex': "female"},
                {'name': 'Jeniffer', 'major': "Computer Science", 'sex': "female"},
                {'name': 'Edward', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Zara', 'major': "Psychology", 'sex': "female"},
                {'name': 'Wendy', 'major': "Economics", 'sex': "female"},
                {'name': 'Sera', 'major': "Psychology", 'sex': "female"},
                {'name': 'John', 'major': "Computer Science", 'sex': "male"},
         ]
df = pd.DataFrame(student_list, columns = ['name', 'major', 'sex'])
df

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female
11      John  Computer Science    male

In [150]:
df.duplicated() # 중복값 찾기

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11     True
dtype: bool

In [151]:
df.drop_duplicates() # 중복값 자동 제거

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

In [152]:
student_list = [{'name': 'John', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Nate', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Abraham', 'major': "Physics", 'sex': "male"},
                {'name': 'Brian', 'major': "Psychology", 'sex': "male"},
                {'name': 'Janny', 'major': "Economics", 'sex': "female"},
                {'name': 'Yuna', 'major': "Economics", 'sex': "female"},
                {'name': 'Jeniffer', 'major': "Computer Science", 'sex': "female"},
                {'name': 'Edward', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Zara', 'major': "Psychology", 'sex': "female"},
                {'name': 'Wendy', 'major': "Economics", 'sex': "female"},
                {'name': 'Nate', 'major': None, 'sex': "male"},
                {'name': 'John', 'major': "Computer Science", 'sex': None},
         ]
df = pd.DataFrame(student_list, columns = ['name', 'major', 'sex'])
df

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Nate              None    male
11      John  Computer Science    None

In [153]:
df.duplicated() # 중복값이 없다고 나올 때

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
dtype: bool

In [154]:
 df.duplicated(['name']) # 키값으로 중복탐색

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10     True
11     True
dtype: bool

In [157]:
df.drop_duplicates(['name']) # default keep = 'first'

       name             major     sex
0      John  Computer Science    male
1      Nate  Computer Science    male
2   Abraham           Physics    male
3     Brian        Psychology    male
4     Janny         Economics  female
5      Yuna         Economics  female
6  Jeniffer  Computer Science  female
7    Edward  Computer Science    male
8      Zara        Psychology  female
9     Wendy         Economics  female

In [158]:
df.drop_duplicates(['name'], keep = 'first') # 두 번째 인자 추가로 앞에 있는 키값 보존

       name             major     sex
0      John  Computer Science    male
1      Nate  Computer Science    male
2   Abraham           Physics    male
3     Brian        Psychology    male
4     Janny         Economics  female
5      Yuna         Economics  female
6  Jeniffer  Computer Science  female
7    Edward  Computer Science    male
8      Zara        Psychology  female
9     Wendy         Economics  female

In [156]:
df.drop_duplicates(['name'], keep = 'last') # 뒤에 있는 값 보존

        name             major     sex
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Nate              None    male
11      John  Computer Science    None

In [167]:
import pandas as pd
school_id_list = [{'name': 'John', 'job': "teacher", 'age': 40},
                {'name': 'Nate', 'job': "teacher", 'age': 35},
                {'name': 'Yuna', 'job': "teacher", 'age': 37},
                {'name': 'Abraham', 'job': "student", 'age': 10},
                {'name': 'Brian', 'job': "student", 'age': 12},
                {'name': 'Janny', 'job': "student", 'age': 11},
                {'name': 'Nate', 'job': "teacher", 'age': None},
                {'name': 'John', 'job': "student", 'age': None}
         ]
df = pd.DataFrame(school_id_list, columns = ['name', 'job', 'age'])
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher   NaN
7     John  student   NaN

In [161]:
df.shape # row, columns 개수 확인

(8, 3)

In [162]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    8 non-null      object
 1   job     8 non-null      object
 2   age     6 non-null      float64
dtypes: float64(1), object(2)
memory usage: 320.0+ bytes

In [163]:
'''True = NaN'''
df.isna()

    name    job    age
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False
6  False  False   True
7  False  False   True

In [164]:
 '''True = NaN'''
df.isnull()

    name    job    age
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False
6  False  False   True
7  False  False   True

In [166]:
'''fillna(key) null값 key로 바꿔'''
df.age = df.age.fillna(0) 
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher   0.0
7     John  student   0.0

In [168]:
'''
df.groupby('job')['age'] = job으로 groupby, age값만
transform('median') = 중앙값찾기
'''
df['age'].fillna(
    df.groupby('job')['age'] = job으로 .transform('median'), inplace = True)
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher  37.0
7     John  student  11.0

In [170]:
'''
apply 심화
'''
import pandas as pd

date_list = [{'yyyy-mm-dd': '2000-06-27'},
             {'yyyy-mm-dd': '2002-10-24'},
            {'yyyy-mm-dd': '2007-12-20'}]
df = pd.DataFrame(date_list, columns = ['yyyy-mm-dd'])
df

   yyyy-mm-dd
0  2000-06-27
1  2002-10-24
2  2007-12-20

In [171]:
'''
split + 연도값만 추출함수
'''
def extract_year(column):
    return column.split("-")[0]

df['year'] = df['yyyy-mm-dd'].apply(extract_year)
df

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2002-10-24  2002
2  2007-12-20  2007

In [173]:
'''
apply에 parameter 넣으려면?
'''
def get_age(year, current_year):
    return current_year - int(year)

df['age'] = df['year'].apply(get_age, current_year=2018) # get_age함수의 파라미터적용값 2018 - int(year)
df

   yyyy-mm-dd  year  age
0  2000-06-27  2000   18
1  2002-10-24  2002   16
2  2007-12-20  2007   11

In [174]:
'''
여러 parameter
'''
def get_introduce(age, prafix, suffix):
    return prafix + str(age) + suffix

df['introduce'] = df['age'].apply(get_introduce, prafix=" I am", suffix ="years old" )
df

   yyyy-mm-dd  year  age         introduce
0  2000-06-27  2000   18   I am18years old
1  2002-10-24  2002   16   I am16years old
2  2007-12-20  2007   11   I am11years old

In [177]:
'''
여러 개의 컬럼 apply
'''
def get_introduce2(row):
    return "I was born in " + str(row.year) + " my age is " + str(row.age)
# == df['introduce']
df.introduce = df.apply(get_introduce2, axis = 1)
'''칼럼명 introduce = get_introduce2함수를 row의 모든 칼럼 적용해서 '''
df

   yyyy-mm-dd  year  age                        introduce
0  2000-06-27  2000   18  I was born in 2000 my age is 18
1  2002-10-24  2002   16  I was born in 2002 my age is 16
2  2007-12-20  2007   11  I was born in 2007 my age is 11

In [178]:
df['introduce']= df.apply(get_introduce2, axis = 1)
df # 동일

   yyyy-mm-dd  year  age                        introduce
0  2000-06-27  2000   18  I was born in 2000 my age is 18
1  2002-10-24  2002   16  I was born in 2002 my age is 16
2  2007-12-20  2007   11  I was born in 2007 my age is 11

## map, applymap

In [180]:
import pandas as pd
date_list = [{'date':'2000-06-27'},
             {'date':'2002-09-24'},
             {'date':'2005-12-20'}]
df = pd.DataFrame(date_list, columns=['date'])
df

         date
0  2000-06-27
1  2002-09-24
2  2005-12-20

In [182]:
'''
apply와 동일해보이는 map함수는 apply처럼 컬럼을 변경할 수 있다
'''
def extract_year(date):
    return date.split('-')[0]
df['year'] = df['date'].map(extract_year)
df

         date  year
0  2000-06-27  2000
1  2002-09-24  2002
2  2005-12-20  2005

In [183]:

job_list = [{'age': 20, 'job': 'student'},
         {'age': 30, 'job': 'developer'},
         {'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(job_list)
df

   age        job
0   20    student
1   30  developer
2   30    teacher

In [185]:
'''
딕셔너리로 직접 전달하면 값을 변경할 수 있다 
'''
df.job = df.job.map({'student':1, "developer":2,"teacher":3})
df

   age  job
0   20    1
1   30    2
2   30    3

In [186]:
'''
applymap
단 하나의 컬럼 변경이 아닌
모든 컬럼을 변경하고 싶을 때
'''
x_y = [{'x': 5.5, 'y': -5.6},
         {'x': -5.2, 'y': 5.5},
         {'x': -1.6, 'y': -4.5}]
df = pd.DataFrame(x_y)
df

     x    y
0  5.5 -5.6
1 -5.2  5.5
2 -1.6 -4.5

In [187]:
import numpy as np
df = df.applymap(np.around) # 모든 컬럼 반올림
df

     x    y
0  6.0 -6.0
1 -5.0  6.0
2 -2.0 -4.0

In [188]:
'''
컬럼에서 어떠한 value가 있는지 확인하고
unique한 value만 뽑으려면?'''
job_list = [{'name': 'John', 'job': "teacher"},
                {'name': 'Nate', 'job': "teacher"},
                {'name': 'Fred', 'job': "teacher"},
                {'name': 'Abraham', 'job': "student"},
                {'name': 'Brian', 'job': "student"},
                {'name': 'Janny', 'job': "developer"},
                {'name': 'Nate', 'job': "teacher"},
                {'name': 'Obrian', 'job': "dentist"},
                {'name': 'Yuna', 'job': "teacher"},
                {'name': 'Rob', 'job': "lawyer"},
                {'name': 'Brian', 'job': "student"},
                {'name': 'Matt', 'job': "student"},
                {'name': 'Wendy', 'job': "banker"},
                {'name': 'Edward', 'job': "teacher"},
                {'name': 'Ian', 'job': "teacher"},
                {'name': 'Chris', 'job': "banker"},
                {'name': 'Philip', 'job': "lawyer"},
                {'name': 'Janny', 'job': "basketball player"},
                {'name': 'Gwen', 'job': "teacher"},
                {'name': 'Jessy', 'job': "student"}
         ]
df = pd.DataFrame(job_list, columns = ['name', 'job'])
df

       name                job
0      John            teacher
1      Nate            teacher
2      Fred            teacher
3   Abraham            student
4     Brian            student
5     Janny          developer
6      Nate            teacher
7    Obrian            dentist
8      Yuna            teacher
9       Rob             lawyer
10    Brian            student
11     Matt            student
12    Wendy             banker
13   Edward            teacher
14      Ian            teacher
15    Chris             banker
16   Philip             lawyer
17    Janny  basketball player
18     Gwen            teacher
19    Jessy            student

In [189]:
df.job.unique() # job칼럼의 값들  분류

array(['teacher', 'student', 'developer', 'dentist', 'lawyer', 'banker',
       'basketball player'], dtype=object)

In [190]:
df.job.value_counts() # job칼럼 값 개수까지

teacher              8
student              5
lawyer               2
banker               2
dentist              1
basketball player    1
developer            1
Name: job, dtype: int64

In [8]:
'''
두 개의 데이터프레임 합치기
'''
import pandas as pd
l1 = [{'name': 'John', 'job': "teacher"},
      {'name': 'Nate', 'job': "student"},
      {'name': 'Fred', 'job': "developer"}]

l2 = [{'name': 'Ed', 'job': "dentist"},
      {'name': 'Jack', 'job': "farmer"},
      {'name': 'Ted', 'job': "designer"}]


l3 = [{'name': 'John', 'job': "teacher"},
      {'name': 'Nate', 'job': "student"},
      {'name': 'Jack', 'job': "developer"}]

l4 = [{'age': 25, 'country': "U.S"},
      {'age': 30, 'country': "Japan"},
      {'age': 45, 'country': "Korea"}]

df1 = pd.DataFrame(l1, columns= [ 'name', 'job'])
df2 = pd.DataFrame(l2, columns= [ 'age', 'country'])

In [2]:
df1

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer

In [3]:
df2

   name       job
0    Ed   dentist
1  Jack    farmer
2   Ted  designer

In [5]:
'''
row합치기
'''
result = pd.concat([df1,df2])
result

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer
0    Ed    dentist
1  Jack     farmer
2   Ted   designer

In [6]:
result = pd.concat([df1,df2], ignore_index=True)
result

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer
3    Ed    dentist
4  Jack     farmer
5   Ted   designer

In [7]:
'''
row합치기2
'''
result = df1.append(df2, ignore_index=True)
result

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer
3    Ed    dentist
4  Jack     farmer
5   Ted   designer

In [9]:
'''
col 합치기
'''
df3 = pd.DataFrame(l3, columns= [ 'name', 'job'])
df4 = pd.DataFrame(l4, columns= [ 'age', 'country'])
df3

   name        job
0  John    teacher
1  Nate    student
2  Jack  developer

In [10]:
df4

   age country
0   25     U.S
1   30   Japan
2   45   Korea

In [13]:
result = pd.concat([df3, df4], axis=1, ignore_index=True)
result

      0          1   2      3
0  John    teacher  25    U.S
1  Nate    student  30  Japan
2  Jack  developer  45  Korea

In [14]:
'''
list합치기
실제값 / 예측값 비교
'''
label = [1,2,3,4,5]
prediction = [1,2,2,4,4]

In [16]:
'''
어떤 value가 정확한 예측값인지 분간하기 힘들 경우
df로 테이블 만들면 3, 5가 잘못 출력된 걸 한눈에 파악 가능함
'''
comparison = pd.DataFrame( {'label':label, 'prediction':prediction})
comparison

   label  prediction
0      1           1
1      2           2
2      3           2
3      4           4
4      5           4

In [ ]:
End